# 6) კომენტარის სახით ახსენით თუ რა უპირატესობები აქვს ფუნქციების გამოყენებას Python-ში.

# 1. კოდის გამეორების თავიდან აცილება
#    ფუნქციები საშუალებას იძლევა იგივე კოდი მრავალჯერ გამოვიყენოთ,
#    რაც ამცირებს ზედმეტი კოდის დაწერის აუცილებლობას.

# 2. კოდის სტრუქტურის გაუმჯობესება
#    ფუნქციები კოდს უფრო ორგანიზებულსა და გაგებადი ქმნის, რაც
#    ამარტივებს მისი რედაქტირებას და მხარდაჭერას.

# 3. კოდის ტესტირების გამარტივება
#    ფუნქციები საშუალებას იძლევა მათი ცალკეული შემოწმება,
#    რაც სისწორის უზრუნველყოფის პროცესს აადვილებს.

# 4. კოდის მასშტაბირების გაუმჯობესება
#    ფუნქციები კოდის მოდულურობას ზრდის, რაც შესაძლებელს
#    ხდის დიდი და კომპლექსური პროექტების დამუშავებას.

# 5. კოდის ხელახალი გამოყენებადობა
#    ფუნქციები შეგიძლიათ გამოიყენოთ სხვადასხვა პროექტში,
#    რაც დროს და რესურსებს ზოგავს.

# 6. კოდის გამჭვირვალეობა და გაგება
#    ფუნქციების კარგი აღწერა და სახელები ხელს უწყობს
#    იმ გუნდებს, რომლებიც კოლაბორაციულ პროექტებზე მუშაობენ.