# # 3) მომხმარებელს შემოატანინეთ ორი რიცხვი  და დაბეჭდეთ მათი ჯამი ,სხვაობა და ნამრავლი . გამოიყენეთ int ფუნქცია.
# nam1 = int (input("enter your namber1: "))
# nam2 = int (input("enter your nameber2: "))
# print(nam1+nam2)

# num1 = int (input("nam1: "))
# num2 = int (input("num2: "))
# print(num1-num2)


# nam0 = int (input("nam0: "))
# nam01 = int (input("nam1: "))
# print(nam0*nam01)

# აქ იმიტომ დავაკემონეტარე რომ ოპერაციები ერთანეთს შეუშლიდნენ ხელს შესაბამისად ეს კოდი არ გამოვიდოდა სწორი რადგან ეს კონკრეტული ოპერაციები შეუშლიდნენ ხელს ჯერ პირველ ოპერაციას გაივლიდა ინფუთიდან მერე მეორეს მერე მესამეს და ა.შ და ამ შემთხვევაში მერჩივნა რომ დამეკომენტარებინა სულ ეს იყო დავალება და ეს ყველაფერი მიწერია სწორად ინფუთიც მაქვს სწორად გაკეთებული