# 1)შექმენით ფუქნცია რომელსაც გადაეცემა 2 არგუმენტი, n1, n2, შემდეგ უნდა დააბრუნოთ  ამ ორი რიცხვის ნამრავლი, თუ მომხარებელი არ შემოიტანს რომელიმე რიცხვს არგუმენტად, ის არგუმენტი გახდეს 0(default value), შემდეგ დაპრინტეთ
def multiply(n1=0, n2=0):
    return n1 * n2
result = multiply(5)  
print("product:", result)

# 3)შექმენით ფუნქცი რომელსაც გადაეცემა 1 არგუმენტი name, შემდეგ ეს ფუნქცია აბურნბეს 2 ცალ მნიშვნოლობას, "Hello" და მეორე თვითონ ეს არგყმენტი name, შემდეგ 2 ცვლადს მინაიჭეთ ეს ფუქნცია და ორივე ცვლადი გამოიტანეთ
def greet(name):
    return "Hello", name
greeting, person_name = greet("giorgi")
print(greeting)
print(person_name)

# 5)შექმენით ფუნქცია, რომელსაც გადაეცემა სტრინგი, შემდეგ გადაამოწმეთამ სტრინგის სიგრძე მეტია თუარა 10 ზე, თუ მეტია დააბრუნოს ეს სტრუნგი სხვა შემთხვევაში დააბრუნეთ "Too short"
def check_length(text):
    if len(text) > 10:
        return text
    else:
        return "Too short"
    
    # 4)შექმენით ფუნქცია რომელსც გადაეცემა 1 რიცხი, შემდეგ ფორ ლუპით ამ რიცხვამდე გამოიტანეთ ყველა რიცხვის ჯამი, თუ არგუმენტი არ გადაეცა გამოძახებისას ეას რიცხვი იყოს 10 იანი(default value)
    def sum_numbers(n=10):
    total = 0
    for i in range(1, n + 1):
        total += i
    return total

