# 1)მომხმარებელს შემოატანინეთ მისი სახელი, შემდეგ შემოატანინეთ მისი გვარი და ბოლოს შემოატანინეთ მისი ასაკი (ყველა შეინახეთ ცვლადებში) და საბოლოოდ დაბეჭდეთ ერთი მლიანი წინადადება /// მაგალითად: "გამარჯობა" + name + surname + "შენ ხარ" + age + "წლის".
name = input("enter your name: ")
surname = input("enter your surname: ")
age = input ("enter your age: ")
print("გამარჯობა" + name + surname + "შენ ხარ" + age + "წლის")
# 2)კომენტარის სახით ახსენით რა არის ინფუთი და რა არის აუთფუთი, მოიყვანეთ თითო-თითო რეალური ცხოვრების მაგალითი ან ნივთი.
