# 1) ივარჯიშეთ შედარების ოპერატორებზე, გააკეთეთ 10-10 მაგალითი. კომენტარებით ახსენით, რა პასუხს გვიბრუნებენ შედარების ოპერატორები.
მაგალითი =10>5
print(მაგალითი)
# ეს მაგალითი გამოგვიტანს "true"
მაგალითი2=20>30
print(მაგალითი2)
# ეს მაგალითი გამოგვიტანს "false"
მაგალითი3=440>550
print(მაგალითი3)
# ეს მაგალითი გამოგვიტანს "false"
მაგალითი4=55<550
print(მაგალითი4)
# ეს მაგალითი გამოგვიტანს "true"
მაგალითი5=55<80
print(მაგალითი4)
# ეს მაგალითი გამოგვიტანს "true"
მაგალითი6=8888<9999
print(მაგალითი6)
# ეს მაგალითი გამოგვიტანს "false"
მაგალითი7=1000000<1
print(მაგალითი7)
# ეს მაგალითი გამოგვიტანს "false"
მაგალითი8=123456789<987654321
print(მაგალითი8)
# ეს მაგალითი გამოგვიტანს "true"
მაგალითი9=123456789>987654321
print(მაგალითი9)
# ეს მაგალითი გამოგვიტანს "false"
მაგალითი10=10=10
print(მაგალითი10)
# ეს მაგალითი გამოგვიტანს "true"