# 1)შექმენით ფუნქცია რომელსაც გადაეცემა 2 არგუმენტი, სტრინგი და რიცხვი, შემდეგ დააბრუნეთ ეს რიცხვი იმდენჯერ რამდენიც ინტეჯერი გამდოგეცათ
def გამრავლებული_სტრინგი(ტექსტი, რიცხვი):
    if isinstance(რიცხვი, int):
        return ტექსტი * რიცხვი
    else:
        return "მეორე არგუმენტი უნდა იყოს მთელი რიცხვი."
    
    # 2)5)შექმენით ფუნქცია, რომელსაც გადაეცემა სტრინგი, შემდეგ გადაამოწმეთამ სტრინგის სიგრძე მეტია თუარა 10 ზე, თუ მეტია დააბრუნოს ეს სტრუნგი სხვა შემთხვევაში დააბრუნეთ "Too short"
def შეამოწმე_სიგრძე(ტექსტი):
    if len(ტექსტი) > 10:
        return ტექსტი
    else:
        return "Too short"