# 2) შექმენით ფუნქცია, რომელსაც არგუმენტად გადაეცემა 4 რიცხვი და ფუნქციის მიზანი იქნება, რომ ამ სამი რიცხვის ჯამი დააბრუნოს.

def sum_three_of_four(a, b, c, d):
    return a + b + c
print(sum_three_of_four(1, 2, 3, 100))

# 3) შექმენით ფუნქცია, რომელიც არგუმენტად მიიღებს მომხმარებლის სახელსა და ასაკს. ფუნქციამ უნდა დააბრუნოს მსგავსი წინადადება:
# "მომხმარებლის სახელი" is "მომხმარებლის ასაკი" წლის.

def user_info(name, age):
     return f'{name} is {age} 
print(user_info("giorgi", 11))

# 4) შექმენით ფუნქცია, რომელიც არგუმენტად მიიღებს ერთ რიცხვს და საბოლოოდ პასუხად დააბრუნებს ამ რიცხვის კვადრატს. (რიცხვის ხარისხში აყვანის ოპერატორია **)
def square(number):
    return number ** 2
print(square(5))  
print(square(-3))

# 5) შექმენით ფუნქცია და გადაეცით ორი რიცხვი პარამეტრებად. ფუქნციამ უნდა დააბრუნოს პირველი რიცხვი აყვანილი მეორე რიცხვის ხარისხში

def power(base, exponent):
    return base ** exponent
print(power(2, 3))  
print(power(5, 2))   
print(power(9, 0)) 